In [1]:
import pandas as pd
from datetime import datetime as dt

<hr style="color:tomato;border:2px solid tomato" >

### <span style="color:red">1. Create a Datetime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe. </span>

In [2]:
df = pd.DataFrame()
df['weekday'] = dt.day

In [3]:
df

Empty DataFrame
Columns: [weekday]
Index: []

<hr style="color:tomato;border:2px solid tomato" >

### <span style="color:blue"> 2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names. </span>

In [4]:
height = [23,42,55]
weight = [71,32,48]
df = pd.DataFrame()
df['height'] = height
df['weight'] = weight
df

   height  weight
0      23      71
1      42      32
2      55      48

##### Alternate appoach

In [5]:
dict={'height':[23,42,55],'weight':[71,32,48]}
df2 = pd.DataFrame(dict)
df2

   height  weight
0      23      71
1      42      32
2      55      48

<hr style="color:tomato;border:2px solid tomato" >

### <span style="color:blue"> 3. How to get the items of series A not present in series B .From ser1 remove items present in ser2.</span>

In [6]:
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])

In [7]:
list(set(ser1.values) - set(ser2.values))

[2, 3, 4]

<hr style="color:tomato;border:2px solid tomato" >

### <span style="color:blue"> Questions on Titanic Dataset :- </span>

In [8]:
titanic = pd.read_csv(r'E:\SupervisedLearning\datasets\titanic.csv')
titanic_orginial = titanic.copy()

#### <span style="color:blue"> 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset </span>

In [9]:
titanic['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

<hr style="color:tomato;border:2px solid tomato" >

#### <span style="color:blue"> 5 How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset
</span>

In [10]:
titanic['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

<hr style="color:tomato;border:2px solid tomato" >

#### <span style="color:blue"> 6 Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset </span>

In [11]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [12]:
replace = {'S':'S','C':'C','Q':'Other'}
titanic['Embarked'] = titanic['Embarked'].map(replace)

In [13]:
titanic['Embarked'].value_counts()

S        644
C        168
Other     77
Name: Embarked, dtype: int64

#### Alternate approach

In [14]:
#This approach captues null values as well
titanic = titanic_orginial.copy()
titanic['Embarked'] = titanic['Embarked'].map( lambda x : x if x in (['S','C']) else 'Other')

In [15]:
titanic['Embarked'].value_counts()

S        644
C        168
Other     79
Name: Embarked, dtype: int64

<hr style="color:tomato;border:2px solid tomato" >

#### <span style="color:blue"> 7 Bin the price column in titanic data set into 5 equal groups and get counts of each bin </span>

In [23]:
# help(pd.qcut)

In [17]:
titanic = titanic_orginial.copy()
titanic['age_bin'] = pd.qcut(titanic['Age'],5)

In [22]:
titanic['age_bin'].value_counts()

(0.419, 19.0]    164
(31.8, 41.0]     144
(41.0, 80.0]     142
(19.0, 25.0]     137
(25.0, 31.8]     127
Name: age_bin, dtype: int64

<hr style="color:tomato;border:2px solid tomato" >

#### <span style="color:blue"> 8 Count the number of missing values in each column

In [25]:
titanic = titanic_orginial.copy()
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64